[
  {
    "Subject": "MetaMask",
    "Wallet Name": "MetaMask",
    "Wallet Type": "Browser extension, mobile app",
    "Supported Blockchains": "MetaMask primarily supports Ethereum and ETH-based tokens (ERC-20, ERC-721, ERC-1155, etc.). It also supports SOL and SOL-based tokens. It is compatible with various EVM-compatible networks.",
    "Connection Protocols": "MetaMask connects to various blockchain networks. It supports WalletConnect for dApp interaction. While not explicitly stated as a 'protocol' in the traditional sense, its core function is to facilitate interaction with EVM-compatible blockchains and now Solana.",
    "Developer Integration": "Developers can integrate with MetaMask using the MetaMask SDK, Web3 Services, Delegation Toolkit, and Embedded Wallets. MetaMask Snaps allow for extending wallet functionality with third-party features.",
    "Security Features": "MetaMask features active threat monitoring, robust security partnerships, 24/7 support, and strong built-in protections. It supports hardware wallets (AirGap Vault, Keystone, Lattice, Ledger, Trezor, NGRAVE ZERO), offers privacy-protection features, and performs network details checks. It stores private keys locally with end-to-end encryption and uses a seed phrase recovery system.",
    "Unique Features": "MetaMask is a self-custodial wallet that allows users to access Web3, buy, sell, swap, send, and receive crypto. It supports NFTs, has a built-in swap feature, and allows users to earn rewards by staking ETH. MetaMask Snaps allow for enhanced wallet functionality. It is rated as a highly secure wallet by Coinspect.",
    "Limitations": "The search results did not explicitly list limitations, but it is a self-custodial wallet, meaning users are responsible for their own keys and seed phrases. It primarily focuses on EVM-compatible chains, though it now supports Solana.",
    "User Base": "MetaMask is trusted by over 100 million users.",
    "Open Source": "MetaMask was initially MIT-licensed open-source software. In August 2020, it changed its license to a new limited license, but core components and many libraries remain open source. The Delegation Toolkit is open-sourced."
  },
  {
    "Subject": "Phantom",
    "Wallet Name": "Phantom",
    "Wallet Type": "Non-custodial software wallet (browser extension, mobile app)",
    "Supported Blockchains": "Solana, Ethereum, Polygon, Bitcoin",
    "Connection Protocols": "WalletConnect (inferred)",
    "Developer Integration": "Not explicitly detailed on the main website, likely through SDKs or APIs for dApp integration.",
    "Security Features": "Self-custodial, private by design (no personal info required), scam detection, Ledger hardware wallet support.",
    "Unique Features": "Multi-chain support (Solana, Ethereum, Polygon, Bitcoin), seamless NFT marketplace access, NFT management (pin, hide, burn, list), fast and low-fee token swaps, staking and earning rewards, 2-click NFT selling.",
    "Limitations": "As a hot wallet, it is more exposed than hardware wallets.",
    "User Base": "Trusted by more than 15 million people (from website footer).",
    "Open Source": "Not explicitly stated on the main website."
  },
  {
    "Subject": "WalletConnect",
    "Wallet Name": "WalletConnect",
    "Wallet Type": "Protocol",
    "Supported Blockchains": "EVM and its L2s, Solana, Cosmos, Polkadot, Bitcoin and more.",
    "Connection Protocols": "WalletConnect v1.0, WalletConnect v2.0 (decoupled session and pairing), Sign API (remote signer protocol)",
    "Developer Integration": "Developers can integrate using the Sign API for dApp-wallet communication and wallet authentication for login/signin. WalletConnect provides SDKs (AppKit, WalletKit) for building Web3 apps and wallets.",
    "Security Features": "Secure remote JSON-RPC transport, encrypted connection, phishing protection (implied by WalletConnect Certified badge and secure connection claims).",
    "Unique Features": "Open-source protocol, enables secure connection between any wallet and any dApp, supports deep linking, one-click passwordless authentication for websites/applications, decentralized infrastructure.",
    "Limitations": "None explicitly stated as limitations, but v1.0 had coupled session/pairing issues that v2.0 addresses.",
    "User Base": "Over 47.5 million users, 300 million connections, 600+ wallets, 67K+ projects.",
    "Open Source": "Yes, it is an open-source protocol."
  },
  {
    "Subject": "Coinbase Wallet",
    "Wallet Name": "Coinbase Wallet",
    "Wallet Type": "Self-custody wallet, Browser extension, Mobile app, Web wallet",
    "Supported Blockchains": "Ethereum, Polygon, Avalanche, BNB Chain, Stellar Lumens, Bitcoin, Dogecoin, Litecoin, Arbitrum, Base, Gnosis Chain, Fantom Opera, Optimism, all EVM-compatible networks, Solana, XRP, Ethereum Classic, all ERC20 tokens",
    "Connection Protocols": "Coinbase Wallet SDK (formerly WalletLink), Deep Linking (for mobile dapps)",
    "Developer Integration": "Coinbase Wallet SDK (open source), Embedded Wallets, Server Wallet",
    "Security Features": "Self-custody, private keys control, multi-factor authentication (including biometrics), username feature (for sending/receiving with names), passkey signatures validated onchain via open-source smart contract",
    "Unique Features": "Self-custody, multi-chain NFT management, integrated DEX trading, staking, fiat on/off ramps, free gasless transactions on select mints, pay directly from Coinbase account (for web app), username feature",
    "Limitations": "No direct customer support, loss of funds if 12-word recovery phrase is lost, transaction limits (though some sources suggest workarounds like reinstalling the app for mobile limits)",
    "User Base": "3.2 million monthly active users for Coinbase Wallet in 2025, Coinbase Smart Wallet surpassed 1 million users on Base network, Coinbase has over 100 million users (overall, not just wallet)",
    "Open Source": "Coinbase Wallet SDK is open source. Passkey signatures are validated onchain via an open source and audited smart contract."
  },
  {
    "Subject": "Trust Wallet",
    "Wallet Name": "Trust Wallet",
    "Wallet Type": "Mobile App, Browser Extension, Self-Custody Hot Wallet",
    "Supported Blockchains": "Over 100+ blockchains, including Bitcoin, Ethereum, Solana, Cosmos, BNB, Tron, Stellar, Tezos, and millions of digital assets.",
    "Connection Protocols": "WalletConnect (implied by general Web3 connectivity and integration with dApps)",
    "Developer Integration": "Developers can integrate using Trust Wallet's Wallet Core, an open-source, cross-platform, mobile-focused library implementing low-level cryptographic wallet functionality. Documentation is available on developer.trustwallet.com.",
    "Security Features": "Non-custodial access, strong encryption, passcodes, biometric authentication (fingerprint/face ID), optional secure element support, encrypted cloud backup, Security Scanner, 12-word recovery phrase.",
    "Unique Features": "Multi-chain support (10M+ crypto assets across 100+ blockchains), built-in DApp browser, integrated staking, token swaps, NFT support, Web3 gateway, supports Tokenized Real-World Assets (RWAs).",
    "Limitations": "Absence of two-factor authentication (2FA) for the wallet itself (though individual exchanges might have it), some users report limited customer support. No transaction volume or daily transaction limits imposed by Trust Wallet itself, but blockchain networks or specific tokens may have their own limits.",
    "User Base": "Over 200 million users globally, with over 200 million total downloads.",
    "Open Source": "Trust Wallet Core is open-source. The broader Trust Wallet project is described as open-source, with continuous improvements based on community feedback."
  },
  {
    "Subject": "Ledger",
    "Wallet Name": "Ledger",
    "Wallet Type": "Hardware Wallet",
    "Supported Blockchains": "15,000+ coins and tokens, including Bitcoin (BTC), Ethereum (ETH), Ripple (XRP), Litecoin (LTC), Bitcoin Cash (BCH), Polkadot (DOT), Chainlink (LINK), Cardano (ADA), Stellar (XLM), Solana (SOL), Tezos (XTZ), and various ERC-20 tokens.",
    "Connection Protocols": "WebHID, WebBLE, React Native BLE, Device Management Kit (DMK), Device Signer Kit (DSK)",
    "Developer Integration": "Developers can integrate with Ledger devices using the Device Management Kit (DMK) and Device Signer Kit (DSK). Boilerplate apps and SDKs are available in C and Rust. Integration with Ledger Live is possible for dApps and blockchain protocols. Clear signing for smart contracts is also supported.",
    "Security Features": "Secure Element chip, proprietary OS, offline storage of private keys (hardware wallet), Ledger Recover for backup, clear signing for transactions.",
    "Unique Features": "Hardware wallet for offline key storage, secure touchscreen for transaction signing, Ledger Live companion app for managing assets, staking, and dApp access, Ledger Recover for seed phrase backup.",
    "Limitations": "The Device Management Kit (DMK) project is still in early development and may have breaking changes. LedgerJS is soon to be deprecated.",
    "User Base": "Over 7 million customers (from Ledger Live page), 6,959,050+ devices sold worldwide (from Developer Portal).",
    "Open Source": "Information not explicitly found on the browsed pages. Further research would be needed to confirm if the hardware or software is open source."
  },
  {
    "Subject": "Trezor",
    "Wallet Name": "Trezor",
    "Wallet Type": "Hardware wallet",
    "Supported Blockchains": "Bitcoin, Ethereum, and other Ethereum-based tokens (ERC-20), and many other cryptocurrencies. (Specific list not fully extracted, but it supports a wide range.)",
    "Connection Protocols": "WalletConnect, direct USB connection to computer, Electrum Server for privacy-focused users.",
    "Developer Integration": "Trezor Connect (API for third-party wallet apps and extensions), documentation for Trezor Suite developers and third-party wallet developers.",
    "Security Features": "Offline storage of private keys, PIN access, passphrase protection, secure element (for some models), physical device protection from online hacks, malware & unauthorized access.",
    "Unique Features": "Pioneered hardware wallet technology, user-friendly design, integration with various third-party wallets (e.g., MetaMask, Exodus, Rabby Wallet).",
    "Limitations": "Requires physical device, may not support all obscure cryptocurrencies immediately upon release.",
    "User Base": "Not explicitly stated in search results, but it is a widely recognized and used hardware wallet.",
    "Open Source": "WalletConnect is open-source. Trezor's firmware and software are generally open-source, but specific licensing details were not immediately available in the search results."
  },
  {
    "Subject": "Rainbow Wallet",
    "Wallet Name": "Rainbow Wallet",
    "Wallet Type": "Mobile App (iOS, Android), Browser Extension",
    "Supported Blockchains": "Primarily Ethereum and EVM-compatible chains including Polygon, Optimism, Arbitrum, Base, Zora, AVAX, and Binance Smart Chain.",
    "Connection Protocols": "WalletConnect (v2), integrates with RainbowKit for dApp connections.",
    "Developer Integration": "RainbowKit (React library for easy wallet connection to dApps), integrates with Wagmi and Viem. Developers can use RainbowKit to add wallet connection to their dApps.",
    "Security Features": "Self-custodial, private keys stored locally and encrypted, biometric/passcode authentication, hardware wallet support (Ledger, Trezor), secure backup options (iCloud, Google Drive, secret phrase), emphasizes user control over funds, prompts and features to avoid scams.",
    "Unique Features": "User-friendly interface, vibrant design, NFT display and management, built-in crypto swaps (Uniswap), Apple Pay support for buying ETH and DAI, ENS integration, impersonation mode (read-only access to any wallet with an address), all L2s supported, custom RPCs, cross-chain swaps, Flashbots protection, hotkey functionalities (desktop extension).",
    "Limitations": "Primarily focused on Ethereum and EVM-compatible chains, lack of two-factor authentication (2FA) mentioned in some sources, app may not work in secure folders on some Android devices.",
    "User Base": "No exact number found, but it has a substantial user base and is attracting users from other wallets like MetaMask. Over 400,000 accounts listed on their points leaderboard.",
    "Open Source": "Yes, Rainbow Wallet is open source and licensed under the GPL 3.0 license. Its code is available on GitHub."
  },
  {
    "Subject": "Argent",
    "Wallet Name": "Argent (now Ready)",
    "Wallet Type": "Mobile app (iOS and Android), browser extension (Argent X for Chrome, Edge, and Firefox), and web wallet (email-based on Starknet). It is a self-custody, non-custodial smart contract wallet.",
    "Supported Blockchains": "Ethereum and Starknet. Supports all ERC-20, ERC-721, and ERC-1155 tokens on Ethereum. Also integrates with Layer 2 solutions like zkSync.",
    "Connection Protocols": "WalletConnect",
    "Developer Integration": "Argent provides smart contracts (argentlabs/argent-contracts on GitHub). It's a smart contract wallet, which enables features like account abstraction, allowing for advanced functionalities and easier integration for developers building on Ethereum and Starknet.",
    "Security Features": "Multi-signature security, biometric authentication, social recovery (eliminates seed phrases), daily transaction limits, built-in whitelists for approved addresses, 2FA (two-factor authentication), integration with Blockaid for enhanced security, passcode protection, and FaceID.",
    "Unique Features": "Smart contract wallet capabilities (enabling social recovery, transaction limits, account freezing, and multicall for batching transactions), no seed phrases, gasless transactions (Argent covers gas fees in certain scenarios), easy-to-read addresses, and one-click access to popular DeFi protocols.",
    "Limitations": "Primarily focused on Ethereum and Starknet; does not directly support other blockchains like Bitcoin, Binance Smart Chain (BSC), or Solana. Daily transaction limits can be set by users.",
    "User Base": "Ready Wallet (formerly Argent X) has over 2 million downloads. Argent has raised $56M in funding. The Argent Telegram wallet aims to connect to 1 billion Telegram users.",
    "Open Source": "Argent's smart contracts are open-source and available on GitHub (argentlabs/argent-contracts). Argent X and Braavos wallets are also non-custodial with open-source smart contracts."
  },
  {
    "Subject": "Gnosis Safe",
    "Wallet Name": "Gnosis Safe (now known as Safe)",
    "Wallet Type": "Smart contract wallet (multisig wallet)",
    "Supported Blockchains": "Available on 15+ networks including Ethereum, Gnosis Chain, Polygon zkEVM, Celo, Optimism, Base, Arbitrum, ZkSync Era Mainnet, Avalanche.",
    "Connection Protocols": "Not explicitly stated, but likely standard blockchain connection protocols given its nature as a smart contract wallet.",
    "Developer Integration": "Developers can integrate with Safe via Safe{Core} SDK for out-of-the-box integrations with 3rd party apps, and Safe{Core} API for infrastructure needed to power interfaces with all Safe account related information (including Safe Transaction Service, Safe Events Service).",
    "Security Features": "Battle-tested, thoroughly audited since 2018, formally verified, and uses multi-sig functionality.",
    "Unique Features": "Leading smart account infrastructure, modular, account abstraction stack, secure multi-sig wallet, trusted by DAOs and web3 native companies.",
    "Limitations": "No specific limitations were found in the provided documentation.",
    "User Base": "Over $100B+ assets secured and 54M total accounts deployed.",
    "Open Source": "Safe{Core} is open-source."
  },
  {
    "Subject": "Exodus",
    "Wallet Name": "Exodus",
    "Wallet Type": "Software wallet (Desktop, Mobile, Web3 Wallet), self-custodial, integrates with hardware wallets (Trezor, Ledger)",
    "Supported Blockchains": "Bitcoin, Ethereum, USDT, Polygon, Solana, and over 1000+ cryptocurrencies and digital assets across 50+ Web3 networks",
    "Connection Protocols": "WalletConnect, hardware wallet integration (Trezor, Ledger)",
    "Developer Integration": "Offers SDK for building new wallets or applications, provides various provider APIs, developer menu (Control + Shift + D), fast and easy integration process for embedding the wallet into applications.",
    "Security Features": "Non-custodial (user controls private keys and 12-word secret recovery phrase), robust encryption, private keys stored locally on device, auto-lock feature, password/passcode, Face ID recognition, Ghost function (hides 12-word seed phrase), manual audit process, secure tooling and automation.",
    "Unique Features": "User-friendly interface, multi-chain support, built-in exchange (DEX and CEX via third-party API providers), staking, NFT marketplace access, dApp access, live charts and portfolio data, 24/7 customer support.",
    "Limitations": "Does not currently support traditional two-factor authentication (2FA).",
    "User Base": "Not explicitly stated in search results, but described as 'world's leading' and 'popular choice'.",
    "Open Source": "WalletConnect is open-source, but it's not explicitly stated if the entire Exodus wallet is open-source."
  },
  {
    "Subject": "Atomic Wallet",
    "Wallet Name": "Atomic Wallet",
    "Wallet Type": "Decentralized, non-custodial (desktop and mobile app)",
    "Supported Blockchains": "Over 100 blockchains and 1000+ coins/tokens (including Bitcoin, Ethereum, Binance Coin, XRP, Litecoin, XLM, ERC-20 tokens)",
    "Connection Protocols": "WalletConnect, Layer 2 protocols, direct blockchain node connection",
    "Developer Integration": "API available for integration (e.g., Vezgo integration, GitHub API for web browsers and multi-crypto SDKs)",
    "Security Features": "Private keys encrypted locally on device, non-custodial, password protection, secure offline seed phrase generation, data encryption, no KYC for basic features",
    "Unique Features": "Built-in atomic swap technology, in-app fiat-to-crypto exchange (credit card, Apple Pay, bank transfer), staking, 24/7 live support, multi-platform support (Windows, MacOS, Debian, Ubuntu, Fedora)",
    "Limitations": "Transaction limits (though not specified in detail), past security incidents (e.g., 2023 hack affecting some users), not fully open source (uses open-source libraries but some parts of code are not)",
    "User Base": "Over 5,000,000 users worldwide (as of 2023), with over 500,000 monthly active users",
    "Open Source": "Not fully open source; uses many open-source libraries but some parts of the code are proprietary."
  },
  {
    "Subject": "Binance Chain Wallet",
    "Wallet Name": "Binance Chain Wallet",
    "Wallet Type": "Browser Extension, Web Wallet (also integrated into Binance app)",
    "Supported Blockchains": "BNB Smart Chain, BNB Beacon Chain, Ethereum",
    "Connection Protocols": "Not explicitly stated, but implies Web3 compatibility for dApp interaction.",
    "Developer Integration": "Wallet SDK available for developers to integrate with the wallet.",
    "Security Features": "MPC technology, 24/7 monitoring, technical audits, regular reviews by top institutions, secure auto sign.",
    "Unique Features": "Keyless security, integrated with Binance exchange for easy transfers, cross-chain token swaps with deep liquidity and low slippage, yield earning opportunities, modular trading system, real-time on-chain data, social sentiment tracking, advanced charts.",
    "Limitations": "Not explicitly stated, but being a browser extension and web wallet, it might have limitations compared to hardware wallets in terms of cold storage security.",
    "User Base": "Not explicitly stated, but implied to be large due to integration with Binance.",
    "Open Source": "Not explicitly stated."
  },
  {
    "Subject": "Keplr",
    "Wallet Name": "Keplr",
    "Wallet Type": "Browser extension, Mobile app, Non-custodial digital wallet",
    "Supported Blockchains": "Cosmos SDK chains, EVM-based networks, Bitcoin, Starknet, and a wide range of specific chains within these ecosystems (e.g., Cosmos Hub, Osmosis, Injective, Ethereum, Arbitrum, Polygon, etc.).",
    "Connection Protocols": "Inter-Blockchain Communication (IBC), WalletConnect, Standard SDK API (for staking data)",
    "Developer Integration": "Seamless compatibility with libraries like CosmJS and SecretJS. Supports adding custom or non-native chains. Offers unified interface and integration model for dApp developers and chain builders.",
    "Security Features": "Private keys stored locally on the user's device, all signing operations must be explicitly approved through the Keplr interface, self-custodial.",
    "Unique Features": "Multi-chain gateway (Cosmos, EVM, Bitcoin, Starknet), unified interface for dApps, cross-chain swap, staking management, app browser, multisig (beta), powerful RPC provider and validator infra.",
    "Limitations": "None explicitly stated in the provided text, but as a non-custodial wallet, users are responsible for their seed phrase/private keys.",
    "User Base": "Over 2 million active users, over 1 million monthly transacting users.",
    "Open Source": "Yes, open-source browser extension and mobile application."
  },
  {
    "Subject": "Terra Station",
    "Wallet Name": "Terra Station",
    "Wallet Type": "Web wallet, Mobile app (iOS, Android), Desktop app (Windows, macOS, Linux), Browser extension (Chrome)",
    "Supported Blockchains": "Terra, Terra Classic, Cosmos SDK-based blockchains",
    "Connection Protocols": "WalletConnect, Ledger, Keplr, private key import",
    "Developer Integration": "Wallet Kit (React library) for dApp integration, API access for querying account balances and sending transactions",
    "Security Features": "Advanced encryption algorithms, multi-factor authentication (2FA), hardware wallet support (Ledger), password protection for transactions",
    "Unique Features": "Cross-chain wallet, supports Terra ecosystem assets, staking, governance voting, Quick Stake feature, multisig wallet support",
    "Limitations": "Primarily focused on the Terra ecosystem, potential polyfill errors for React app integration (workarounds available)",
    "User Base": "Million+ users across the world (as of May 2022)",
    "Open Source": "Yes, the Terra protocol and related tools are open-source."
  },
  {
    "Subject": "Solflare",
    "Wallet Name": "Solflare",
    "Wallet Type": "Non-custodial digital wallet (web app, browser extension, mobile app)",
    "Supported Blockchains": "Solana blockchain",
    "Connection Protocols": "Solana Wallet Adapter, Solflare Wallet SDK, MetaMask adapter (via Solana Wallet Adapter)",
    "Developer Integration": "Developers can integrate using the Solana Wallet Adapter or the Solflare Wallet SDK. API endpoints are available for notifications.",
    "Security Features": "Non-custodial, local key storage, hardware wallet integration (Ledger, Keystone), token filtering, hot wallet isolation, scam filters.",
    "Unique Features": "In-app browser, in-app staking, in-app swapping, Solana Pay compatibility, sophisticated notification systems, 60 FPS refresh rates for NFTs, bulk burn, bulk send, 24/7 support.",
    "Limitations": "Primarily focused on the Solana blockchain.",
    "User Base": "Trusted by 4M+ active users (according to their X/Twitter page).",
    "Open Source": "Information not explicitly found in the provided documentation."
  },
  {
    "Subject": "Backpack",
    "Wallet Name": "Backpack",
    "Wallet Type": "Browser Extension, Mobile App, Exchange Wallet",
    "Supported Blockchains": "Solana, Ethereum, Monad, Sui, Polygon, Base, Arbitrum, Optimism",
    "Connection Protocols": "Standard Web3 connections",
    "Developer Integration": "Supports integration with dApps for minting, trading, and other on-chain activities. Developers can build next-gen dApps that interact with Backpack.",
    "Security Features": "Self-custodial (user holds keys), Secret Recovery Phrase (seed phrase) for backup, secure password, biometrics (optional for mobile). Users are warned against screenshots or cloud storage of seed phrase.",
    "Unique Features": "All-in-one crypto app (futures, spot, lending, crypto wallet), 'basecamp for onchain adventures', supports airdrops, NFTs, early access to next-gen dApps, in-wallet chat (from search results).",
    "Limitations": "None explicitly stated in the provided article, but generally, self-custodial wallets require users to secure their own seed phrase, and loss of seed phrase means loss of funds.",
    "User Base": "Not explicitly stated in the provided article.",
    "Open Source": "The GitHub link in the search results suggests it is open source (coral-xyz/backpack)."
  },
  {
    "Subject": "Glow",
    "Wallet Name": "Glow",
    "Wallet Type": "Mobile App (Android, iOS), Browser Extension (Chrome, Edge, Firefox, Brave)",
    "Supported Blockchains": "Solana",
    "Connection Protocols": "dApp connection protocols (e.g., WalletConnect)",
    "Developer Integration": "Through dApp connection protocols, allowing dApps to connect and interact with the wallet.",
    "Security Features": "Users hold their secret keys (non-custodial), spam token burner.",
    "Unique Features": "Zero-fee swaps, in-app staking, NFT explorer, spam token burner, mobile-first design, identity features for dApps.",
    "Limitations": "Primarily focused on the Solana ecosystem.",
    "User Base": "Not explicitly stated, but available on major app stores and browser extension stores.",
    "Open Source": "Not explicitly stated as open-source on the official website, but some sources mention it as open-source. Further verification needed for definitive answer."
  },
  {
    "Subject": "Slope",
    "Wallet Name": "Slope Wallet",
    "Wallet Type": "Mobile App, Browser Extension",
    "Supported Blockchains": "Solana, Ethereum",
    "Connection Protocols": "URL scheme method for mobile, Web3 APIs for browser extension",
    "Developer Integration": "Developers can integrate with Slope Wallet on Solana and Ethereum. For browser extensions, Web3 APIs allow websites to request user addresses and interact with dApps. For mobile, integration uses URL schemes.",
    "Security Features": "Non-custodial wallet. Users are advised to not execute QR codes/links from unknown sources, not disclose sensitive information, not take screenshots of private keys/mnemonics, and not use wallets/export private keys in insecure environments. (Note: Past security vulnerabilities related to plain text seed phrase storage have been reported, but the wallet is non-custodial.)",
    "Unique Features": "First cross-platform wallet for Solana, supports Slope DEX and Slope NFTs Market, DApp browser, allows cloning Ethereum assets on Solana, low transaction fees (1/1000 of Ethereum).",
    "Limitations": "Past security incidents involving plain text seed phrase storage have been reported. Users cannot retrieve wallet if mnemonics are lost.",
    "User Base": "Not explicitly stated, but widely used within the Solana ecosystem.",
    "Open Source": "Some integrations, like Dialect's, are open source. The wallet itself is non-custodial."
  },
  {
    "Subject": "Math Wallet",
    "Wallet Name": "Math Wallet",
    "Wallet Type": "Multi-platform (mobile/desktop/hardware), browser extension, web wallet, cloud wallet.",
    "Supported Blockchains": "150+ chains including BTC, ETH, Polkadot, Filecoin, Solana, BSC, Cosmos, Aptos, Sui, Arweave, Tezos, Flow, TRON, Near, Bitcoin Lightning, EOS, BNB Beacon Chain, Conflux, Nervos, TON, EVM-based chains (Ethereum, BSC, Arbitrum, Polygon, Fantom, Moonbeam, MathChain L2, etc.), Substrate-based chains (Polkadot, Kusama, Acala, Karura, etc.), and Cosmos SDK chains (Cosmos, Sei, IRISnet, KAVA, THORChain, etc.).",
    "Connection Protocols": "WalletConnect Protocol (QR code), SimpleWallet API (for native dApps), Ethereum object injection for web applications (EVM chains).",
    "Developer Integration": "Developers can integrate dApps for web and native applications using the MathWallet API. For web applications, MathWallet injects an 'ethereum' object into the window, allowing detection via 'window.ethereum.isMathWallet'. Connection is established via 'eth_requestAccounts', and transactions can be sent using 'eth_sendTransaction' and messages signed. For native dApps, the SimpleWallet API is available.",
    "Security Features": "Multi-dimensional security reminders, URL blacklist blocking, BNBChain contract security scoring, two-factor authentication, biometric login, encryption, private key management, and password protection.",
    "Unique Features": "Multi-chain support, built-in dApp browser/store, cross-chain exchange, MathVerse (NFT based AI Co-create Virtual World), MathChain (Layer 2 blockchain), MATH Token, MathAgentics (AI-powered wallet feature), and MathPay (crypto payment integration).",
    "Limitations": "Anecdotal reports of scam concerns on Reddit, but no officially confirmed limitations.",
    "User Base": "Estimated 3.5 Million Users.",
    "Open Source": "Yes, a GitHub repository is available."
  },
  {
    "Subject": "TokenPocket",
    "Wallet Name": "TokenPocket",
    "Wallet Type": "Multi-chain self-custodial wallet (mobile, extension, hardware)",
    "Supported Blockchains": "BTC, ETH, BSC, Polygon, Solana, HECO, Klaytn, Avalanche, Tron, OEC, HSC, Fantom, Polkadot, Kusama, EOS, etc.",
    "Connection Protocols": "QRCode Protocol, TIP Protocol, Wallet Connect",
    "Developer Integration": "Github, Discord, and documentation on how to contribute code, use development library, and submit projects.",
    "Security Features": "Generates and stores keys and passwords on device only, hardware cold wallet, MultiSig wallet feature.",
    "Unique Features": "DApp Store integrated, TP Card (Pay with Crypto), Bridge among different chains, Buy Crypto with credit cards.",
    "Limitations": "None explicitly stated on the main page or developer docs, but further research might reveal some.",
    "User Base": "Over 10 million users, 5 million+ monthly active users, in 200+ countries.",
    "Open Source": "Not explicitly stated as fully open source, but provides developer community links (Github, Discord) for contributions."
  },
  {
    "Subject": "SafePal",
    "Wallet Name": "SafePal",
    "Wallet Type": "Hardware wallet (S1, S1 Pro, X1), Mobile App, Browser Extension",
    "Supported Blockchains": "200+ blockchains and thousands of tokens, including Bitcoin (BTC), Ethereum (ETH), Ripple (XRP), BNB Chain (BNB), Solana (SOL), Dogecoin (DOGE), Litecoin (LTC), Optimism (OP), Avalanche (AVAX), Polygon (POL), Core Chain ($CORE), Caduceus Metaverse Protocol (CMP), and all ERC20, BEP, TRC, XLM, and NEO tokens.",
    "Connection Protocols": "QRcode communication protocol, window.safepalProvider for DApp integration. SafePal S1 hardware wallet uses air-gapped technology (no Bluetooth, WiFi, or NFC) for offline signing.",
    "Developer Integration": "Developers can integrate with SafePal by checking for window.safepalProvider and optimizing their DApps for the SafePal wallet. SafePal also supports QRcode communication protocol for DApp integration.",
    "Security Features": "Military-grade security, air-gapped technology (for S1), EAL5+ secure element, self-destruct mechanism, true random number generator, multiple layers of security protocols.",
    "Unique Features": "Mobile-friendly, supports major cryptocurrencies, in-app trading mini-programs, earn crypto programs, broad asset support, cross-chain compatibility, DApp interaction, NFT buying/selling, blockchain gaming, liquidity mining, user-friendly interface, non-custodial (your keys, your crypto), cross-platform (iOS, Android, Chrome, Firefox, Edge), community-powered development.",
    "Limitations": "SafePal S1 hardware wallet is closed source according to some user reviews, though the X1 is open-sourced. Battery life on S1 was a downside for some users.",
    "User Base": "Over 20 million users.",
    "Open Source": "SafePal X1 hardware wallet is open-sourced. The SafePal S1 hardware wallet is mentioned as closed source in some user reviews."
  },
  {
    "Subject": "Bitget Wallet",
    "Wallet Name": "Bitget Wallet",
    "Wallet Type": "Mobile app (iOS, Android), Browser extension (Chrome), Web3 wallet",
    "Supported Blockchains": "130+ blockchains, including Avalanche, Bitcoin, BNB Chain, Degen Chain, Ethereum, Polkadot, Polygon, Ripple, Solana, Tron.",
    "Connection Protocols": "Compatible with Ethereum-based protocols (e.g., `window.bitkeep.ethereum.enable()`, `eth_sendTransaction`).",
    "Developer Integration": "Developers can integrate by getting the Eth Provider (`window.bitkeep.ethereum`), connecting the wallet (`window.bitkeep.ethereum.enable()`), and signing/broadcasting transactions using `eth_sendTransaction` method.",
    "Security Features": "Private key encryption (Proprietary encryption algorithm, DESM algorithm, passcode), $300 million user protection fund, transaction environment security (collaboration with Go+), security audit guarantee (Certik and SlowMist), comprehensive asset storage solution (MPC wallet and hardware wallet connection), long-term security education, quick detection and revocation of excessive authorization, phishing website identification and risk alerts.",
    "Unique Features": "One-click trading at low fees, real-time Alpha insights and hot picks, automated interest earnings (3-8% APY on stablecoins and major tokens), shop worldwide and pay instantly with crypto, low-fees worldwide transfers in seconds, one-stop Web3 wallet (DApps, NFTs, DeFi, airdrops).",
    "Limitations": "None explicitly stated on the website.",
    "User Base": "80,000,000+ users.",
    "Open Source": "Swap base code developed in open source."
  },
  {
    "Subject": "OKX Wallet",
    "Wallet Name": "OKX Wallet",
    "Wallet Type": "Browser extension, Mobile app, Web wallet",
    "Supported Blockchains": "Over 100 blockchains, including Bitcoin, Ethereum, Solana, TON, EVM and non-EVM compatible chains.",
    "Connection Protocols": "OKX Connect protocol (supports Solana, Sui, and Telegram Mini Apps), RPC (Remote Procedure Call)",
    "Developer Integration": "OKX Wallet provides SDKs (Go and TypeScript/JavaScript) for building wallet applications with offline transaction capabilities. It also offers APIs for integrating with decentralized exchanges (DEX) and NFT platforms. Developers can add a 'Connect OKX Wallet' button to DApps for interaction.",
    "Security Features": "Non-custodial storage, Two-Factor Authentication (2FA), biometric verification, encryption, secure hot and cold wallet systems with multiple approvals and backups, air-gapped feature (with Keystone hardware wallet).",
    "Unique Features": "Create up to 1,000 sub-accounts, built-in DEX, staking aggregator, integrated NFT marketplace, access to thousands of DApps, multi-chain and cross-chain capabilities, supports Blinks across all EVM chains.",
    "Limitations": "Self-custody requires technical knowledge. Restricted in some regions due to regulatory limitations (e.g., USA, Canada, UK). Temporary service pauses for critical bugs or security threats.",
    "User Base": "Engaged over 2.3 million users in a recent campaign, reported a 991% increase in wallet users in 2024. Millions of users worldwide.",
    "Open Source": "OKX Web3 Wallet Multi-chain Signature SDK is fully open source."
  },
  {
    "Subject": "1inch Wallet",
    "Wallet Name": "1inch Wallet",
    "Wallet Type": "Mobile App (Self-custodial)",
    "Supported Blockchains": "Ethereum, BNB Chain, Polygon, Optimistic, Solana, and other major L1 and L2 networks (11+ chains)",
    "Connection Protocols": "Web3 applications using QR code",
    "Developer Integration": "Through the 1inch Wallet and its in-app browser functionalities, powered by 1inch Shield API.",
    "Security Features": "Self-custody (user controls assets), Protected backup (AES256 encrypted file/cloud backup via Apple iCloud/Google Drive), Scam protection (against scam tokens, dApps, and domains via 1inch Shield API).",
    "Unique Features": "Built-in DEX aggregator, in-app browser for Web3 apps, NFT viewing/organization/transfer, fiat-to-crypto purchases, portfolio analysis, cross-chain swaps, Ledger hardware device support, advanced transaction management (cancel/adjust gas prices), 22 supported languages, track balance in 40+ fiat currencies.",
    "Limitations": "None explicitly stated on the official wallet page, but general limitations of self-custodial wallets apply (e.g., user responsible for seed phrase security).",
    "User Base": "Not specified on the official wallet page.",
    "Open Source": "Not specified on the official wallet page."
  }
]